===
top
===

a: _

---

(source_file (field (label (identifier)) (value (top))))

===
bottom
===

e: _|_

---

(source_file (field (label (identifier)) (value (bottom))))

===
null
===

n: null

---

(source_file (field (label (identifier)) (value (null))))

===
bool
===

a: bool
b: true | false

---

(source_file
 (field (label (identifier)) (value (primitive_type)))
 (field (label (identifier)) (value (binary_expression (boolean) (boolean)))))
